g/First.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>First</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-10-21 19:12:39 EDT"/>
<meta name="author" content="Greg"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
</head>
<body>
<div id="content">

<h1 class="title">First</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Notes on First-Order Logic </a>
<ul>
<li><a href="#sec-1.1">1.1 What is Symbolic Logic (or Mathematical Logic)? </a></li>
<li><a href="#sec-1.2">1.2 Primer Problems for First-Order Logic (Smullyan-2007.110-110) </a>
<ul>
<li><a href="#sec-1.2.1">1.2.1 All of us here are the same type. </a></li>
<li><a href="#sec-1.2.2">1.2.2 Some of us are knights and some are knaves. </a></li>
<li><a href="#sec-1.2.3">1.2.3 All of us are knaves/Is it true that all the inhabitants are knaves? </a></li>
<li><a href="#sec-1.2.4">1.2.4 All knights on this island smoke. </a></li>
<li><a href="#sec-1.2.5">1.2.5 Some knaves on this island smoke. </a></li>
<li><a href="#sec-1.2.6">1.2.6 If I smoke, then all the inhabitants of this island smoke. </a></li>
<li><a href="#sec-1.2.7">1.2.7 If any inhabitant of this island smokes, then I smoke. </a></li>
<li><a href="#sec-1.2.8">1.2.8 Some of us smoke, but I don't. </a></li>
<li><a href="#sec-1.2.9">1.2.9 And so on&hellip; </a></li>
</ul>
</li>
<li><a href="#sec-1.3">1.3 Beginning First Order Logic (Smullyan-2007.111) </a></li>
<li><a href="#sec-1.4">1.4 Some Important Results in First Order Logic (Smullyan-2007.297) </a>
<ul>
<li><a href="#sec-1.4.1">1.4.1 Completeness Theorem for Tableaux </a></li>
<li><a href="#sec-1.4.2">1.4.2 Skolem-Lowenheim Theorem </a></li>
<li><a href="#sec-1.4.3">1.4.3 Compactness Theorem </a></li>
<li><a href="#sec-1.4.4">1.4.4 Regularity Theorem </a></li>
<li><a href="#sec-1.4.5">1.4.5 The Completeness of the Axiom System G2 </a></li>
<li><a href="#sec-1.4.6">1.4.6 Craig's Interpolation Lemma (and its applications) </a></li>
<li><a href="#sec-1.4.7">1.4.7 Theorem AM </a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Notes on First-Order Logic </h2>
<div class="outline-text-2" id="text-1">

<p>According to Raymond Smullyan, <i>first-order logic</i> (or predicate
logic) is "an enormous advance over propositional logic" and is
an "adequate logical framework for the entire body
of mathematics". (Smullyan-2007,83). That is a big
claim and provides a great deal of motivation for one
who is interested in mathematics. The goal of these
notes is to understand what this means.
</p>

</div>

<div id="outline-container-1.1" class="outline-3">
<h3 id="sec-1.1"><span class="section-number-3">1.1</span> What is Symbolic Logic (or Mathematical Logic)? </h3>
<div class="outline-text-3" id="text-1.1">

<p>Symbolic/mathematical logic deals with <i>propositions</i>
and <i>arguments</i> codified into symbolic forms to make 
reasoning more precise.
</p></div>

</div>

<div id="outline-container-1.2" class="outline-3">
<h3 id="sec-1.2"><span class="section-number-3">1.2</span> Primer Problems for First-Order Logic (Smullyan-2007.110-110) </h3>
<div class="outline-text-3" id="text-1.2">


</div>

<div id="outline-container-1.2.1" class="outline-4">
<h4 id="sec-1.2.1"><span class="section-number-4">1.2.1</span> All of us here are the same type. </h4>
<div class="outline-text-4" id="text-1.2.1">

</div>

</div>

<div id="outline-container-1.2.2" class="outline-4">
<h4 id="sec-1.2.2"><span class="section-number-4">1.2.2</span> Some of us are knights and some are knaves. </h4>
<div class="outline-text-4" id="text-1.2.2">

</div>

</div>

<div id="outline-container-1.2.3" class="outline-4">
<h4 id="sec-1.2.3"><span class="section-number-4">1.2.3</span> All of us are knaves/Is it true that all the inhabitants are knaves? </h4>
<div class="outline-text-4" id="text-1.2.3">

</div>

</div>

<div id="outline-container-1.2.4" class="outline-4">
<h4 id="sec-1.2.4"><span class="section-number-4">1.2.4</span> All knights on this island smoke. </h4>
<div class="outline-text-4" id="text-1.2.4">

</div>

</div>

<div id="outline-container-1.2.5" class="outline-4">
<h4 id="sec-1.2.5"><span class="section-number-4">1.2.5</span> Some knaves on this island smoke. </h4>
<div class="outline-text-4" id="text-1.2.5">

</div>

</div>

<div id="outline-container-1.2.6" class="outline-4">
<h4 id="sec-1.2.6"><span class="section-number-4">1.2.6</span> If I smoke, then all the inhabitants of this island smoke. </h4>
<div class="outline-text-4" id="text-1.2.6">

</div>

</div>

<div id="outline-container-1.2.7" class="outline-4">
<h4 id="sec-1.2.7"><span class="section-number-4">1.2.7</span> If any inhabitant of this island smokes, then I smoke. </h4>
<div class="outline-text-4" id="text-1.2.7">

</div>

</div>

<div id="outline-container-1.2.8" class="outline-4">
<h4 id="sec-1.2.8"><span class="section-number-4">1.2.8</span> Some of us smoke, but I don't. </h4>
<div class="outline-text-4" id="text-1.2.8">

</div>

</div>

<div id="outline-container-1.2.9" class="outline-4">
<h4 id="sec-1.2.9"><span class="section-number-4">1.2.9</span> And so on&hellip; </h4>
<div class="outline-text-4" id="text-1.2.9">

</div>
</div>

</div>

<div id="outline-container-1.3" class="outline-3">
<h3 id="sec-1.3"><span class="section-number-3">1.3</span> Beginning First Order Logic (Smullyan-2007.111) </h3>
<div class="outline-text-3" id="text-1.3">

<ul>
<li>
Objects (x,y,z&hellip;)
</li>
<li>
Properties (P,Q,R&hellip;)

</li>
</ul>

<p>Given any property P and any object x, the proposition that x has
the property P is symbolized as Px.
</p>
<p>
How do we say that <i>every</i> object x has property P?
</p>
<p>
@ is the <i>universal quantifier</i>, which stands for "all" or "every".
Thus @x is read "for all x" or "for every x", and so the English 
sentence "Everything has the property P" is symbolically rendered
as @xPx (read "For every x, Px")
</p>
<p>
$ is the <i>existential quantifier</i>, which stands for "there exists
at least one". Then the proposition that at least one object x has
the property P is symbolized $xPx.
</p>
<p>
To repeat:
</p>
<dl>
<dt>@xPx</dt><dd>
Universal Quantifier
</dd>
<dt>$xPx</dt><dd>
Existential Quantifier

</dd>
</dl>

<p>Some sentences.
</p><dl>
<dt>Gx</dt><dd>
"x is good"
</dd>
<dt>@xGx</dt><dd>
"Everyone is good"
</dd>
<dt>$xGx</dt><dd>
"Some people are good"

</dd>
<dt>~$xGx</dt><dd>
"No one is good" (it is <i>not</i> the case that there exists a good person)
</dd>
<dt>@x(~Gx)</dt><dd>
"No one is good" (for every person x, x is not good)

</dd>
<dt>Hx</dt><dd>
"x goes to heaven"
</dd>
<dt>@x(Gx=&gt;Hx)</dt><dd>
"All good people go to heaven" (for every person x, if x is good, then x goes to heaven)  
</dd>
<dt>@x(~Gx=&gt;~Hx)</dt><dd>
"Only good people go to heaven"
</dd>
<dt>@x(Hx=&gt;Gx)</dt><dd>
"Only good people go to heaven"
</dd>
<dt>$x(Gx&amp;Hx)</dt><dd>
"Some good people go to heaven"
</dd>
<dt>~$x(Gx&amp;Hx)</dt><dd>
"No good person goes to heaven"
</dd>
<dt>~$x(Gx&amp;~Hx)</dt><dd>
"No good person fails to go to heaven"

</dd>
</dl>

<p>Note that "No good person fails to go to heaven" is just a roundabout
way of saying "All good people go to heaven", so
</p><dl>
<dt>~$x(Gx&amp;~Hx)</dt><dd>


</dd>
</dl>

<p>is equivalent to 
</p>
<dl>
<dt>@x(Gx=&gt;Hx)</dt><dd>


</dd>
</dl>
</div>

</div>

<div id="outline-container-1.4" class="outline-3">
<h3 id="sec-1.4"><span class="section-number-3">1.4</span> Some Important Results in First Order Logic (Smullyan-2007.297) </h3>
<div class="outline-text-3" id="text-1.4">


</div>

<div id="outline-container-1.4.1" class="outline-4">
<h4 id="sec-1.4.1"><span class="section-number-4">1.4.1</span> Completeness Theorem for Tableaux </h4>
<div class="outline-text-4" id="text-1.4.1">

<p>Every valid formula is provable by the tableaux method.
</p></div>

</div>

<div id="outline-container-1.4.2" class="outline-4">
<h4 id="sec-1.4.2"><span class="section-number-4">1.4.2</span> Skolem-Lowenheim Theorem </h4>
<div class="outline-text-4" id="text-1.4.2">

<p>For any set <i>S</i> of formulas, if <i>S</i> is satisfiable, then <i>S</i>
is satisfiable in a denumerable domain.
</p></div>

</div>

<div id="outline-container-1.4.3" class="outline-4">
<h4 id="sec-1.4.3"><span class="section-number-4">1.4.3</span> Compactness Theorem </h4>
<div class="outline-text-4" id="text-1.4.3">

<p>For any infinite set of <i>S</i> of formulas, if every finite subset
of <i>S</i> is satisfiable, then <i>S</i> is satisfiable.
</p></div>

</div>

<div id="outline-container-1.4.4" class="outline-4">
<h4 id="sec-1.4.4"><span class="section-number-4">1.4.4</span> Regularity Theorem </h4>
<div class="outline-text-4" id="text-1.4.4">

<p>Every valid sentence <i>X</i> is truth-functionally implied by a regular
set <i>R</i>.
</p></div>

</div>

<div id="outline-container-1.4.5" class="outline-4">
<h4 id="sec-1.4.5"><span class="section-number-4">1.4.5</span> The Completeness of the Axiom System G2 </h4>
<div class="outline-text-4" id="text-1.4.5">

</div>

</div>

<div id="outline-container-1.4.6" class="outline-4">
<h4 id="sec-1.4.6"><span class="section-number-4">1.4.6</span> Craig's Interpolation Lemma (and its applications) </h4>
<div class="outline-text-4" id="text-1.4.6">

</div>

</div>

<div id="outline-container-1.4.7" class="outline-4">
<h4 id="sec-1.4.7"><span class="section-number-4">1.4.7</span> Theorem AM </h4>
<div class="outline-text-4" id="text-1.4.7">

</div>
</div>
</div>
</div>
<div id="postamble">
<p class="author"> Author: Greg
<a href="mailto:greg@greg-Satellite-C855D">&lt;greg@greg-Satellite-C855D&gt;</a>
</p>
<p class="date"> Date: 2013-10-21 19:12:39 EDT</p>
<p class="creator">HTML generated by org-mode 6.33x in emacs 23</p>
</div>
</div>
</body>
</html>
